# How do I rename columns in a pandas dataframe ?

üêº Tuto on pandas by Data School - Exercice performed by Dorian.H Mekni ü•á | Thu 26 Nov 2020

In [56]:
import pandas as pd

In [57]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [58]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [59]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')


‚≠êÔ∏è The '.columns' attributes indicates into a list, the names of the columns the dataframe contains. It is followed by the datatype of these objects being strings.

In [60]:
ufo.rename(columns = {'Colors Reported' : 'Colors_Reported'})

,City,Colors_Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00
...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,12/31/2000 23:00
18237,Spirit Lake,NaN,DISK,IA,12/31/2000 23:00
18238,Eagle River,NaN,NaN,WI,12/31/2000 23:45
18239,Eagle River,RED,LIGHT,WI,12/31/2000 23:45
18240,Ybor,NaN,OVAL,FL,12/31/2000 23:59


‚≠êÔ∏è The method '.rename()' modifies a name of a column by creating a dictionary in which, the index is the old name of the selected column, and the value after the colon is the new name you wish to call it.

In [61]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')


‚ùóÔ∏èDon't forget to include the argument 'inplace' and set it to 'True'meaning that you want your operation to alter inline the underlined dataframe.

üßê You can also rename several columns in one operation.

In [62]:
ufo.rename(columns = {'Colors Reported' : 'Colors_Reported', 'Shape Reported' : 'Shape_Reported'}, inplace=True)

In [63]:
ufo.columns

Index(['City', 'Colors_Reported', 'Shape_Reported', 'State', 'Time'], dtype='object')


‚úÖ Once the argument 'inline' added and set to 'True', we now notice that the column 'Color Reported' has been transformed as per our commands.


‚ûïIf we wish to change the name of all our columns name at once, we can use a different method that would just do that in a quicker way.

In [64]:
ufo_cols = ['city', 'colors reported', 'shape reported', 'state', 'time']

In [65]:
ufo.columns = ufo_cols

In [66]:
ufo.head()

                   city colors reported shape reported state             time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00


‚≠êÔ∏è We have created a regular python list with the names all put in lowercase. I encapsulate this list into a variable which I name accordingly for the purpose of my pursued actions. I then equal the '.columns' with my variable to override the old columns attributes with the 5 strings I have passed into my list.


üßê There is also another method of renaming the columns while reading the file.

In [67]:
ufo = pd.read_csv('http://bit.ly/uforeports', names=ufo_cols, header=0)

In [68]:
ufo.head()

                   city colors reported shape reported state             time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00


‚≠êÔ∏è This operation is conducted towards a successful result as per our request. We added for that reason two new arguments. We have specified names using the new values created and contained within our variable 'ufo_cols'. We then set the header to 0. It means that the list of strings we are using shall implemented from the index zero of the column rows so that it fits approprietly wiht the observations contained within each column.


# üé© Bonus tips : iPython | Jupyter Notebook ONLY


ü§† Let's assume you have underscores in all your columns and you wish to replace it with spaces. In this assumption, the number of columns is greater than 5, which makes the adventure of using the two previous methods a bit of a writting stretch ! 

Let's see what we can use here :

In [69]:
ufo.columns = ufo.columns.str.replace('_', ' ')

In [70]:
ufo.columns

Index(['city', 'colors reported', 'shape reported', 'state', 'time'], dtype='object')


‚úÖ It has worked peferctly fine. Bear in mind that in our example, we only had two columns to change but it would work equally and similarly if we had a thousand columns.


üôèüèª Thank you !


üëãüèª See you in the next one !